ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПраваНастройки/ЖБИ_ПраваНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПраваНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЖБИ_ПраваНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЖБИ_ПраваНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/ЖБИ_НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НоменклатураПоставщиков</name>
  <comment>ЖБИ - Номенклатура поставщиков</comment>
  <resources>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОсторожно</name>
    <comment>Осторожно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаОбщепринятая</name>
    <comment>Маркировка общепринятая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенноеНаименование</name>
    <comment>Расширенное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативныйДокумент</name>
    <comment>Норматив. документ</comment>
    <type>
      <types>CatalogRef.ЖБИ_НормативныеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <comment>Качество</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <comment>Вес, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Объем м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <comment>Длина мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрММ</name>
    <comment>Диаметр мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтверстиеММ</name>
    <comment>Отверстие, мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВх</name>
    <comment>Диаметр вх. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВых</name>
    <comment>Диаметр вых. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочаяДлина</name>
    <comment>Рабочая длин. мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаСтенки</name>
    <comment>Толщина стенки мм.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Глубина</name>
    <comment>Глубина, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМакс</name>
    <comment>Шир. макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМин</name>
    <comment>Шир. мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМакс</name>
    <comment>Высота, макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМин</name>
    <comment>Высота, мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Армирование</name>
    <comment>Армирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БетонВ</name>
    <comment>Бетон, В</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВодонепрW</name>
    <comment>Водонепр. W</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МорозF</name>
    <comment>Мороз. F</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертифицированДо</name>
    <comment>Сертифицирован до</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолВУпаковке</name>
    <comment>Кол-во в упаковке, шт</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесАвто</name>
    <comment>Вес в авто, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <comment>Направление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Коментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мощность</name>
    <comment>Производственные мощности, шт./м2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПаузе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_ШаблонПочтовыхСообщений/ЖБИ_ШаблонПочтовыхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖБИ_ШаблонПочтовыхСообщений</name>
  <comment>ЖБИ - Шаблон почтовых сообщений</comment>
  <attributes>
    <name>ШаблонСообщения</name>
    <comment>Шаблон сообщения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйКод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/CommonModules/ЖБИ_ОбщегоНазначенияСервер/Module.bsl
Функция РазницаВМесяцах(ДатаНач, ДатаКон) Экспорт 
	
    Лет1 = Год(ДатаНач);
    Месяцев1 = Месяц(ДатаНач);
    Если НачалоДня(ДатаНач) <> НачалоДня(КонецМесяца(ДатаНач)) Тогда
        Дней1 = День(ДатаНач);
    Иначе
        Дней1 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли; 

    Лет2 = Год(ДатаКон);
    Месяцев2 = Месяц(ДатаКон);
    Если НачалоДня(ДатаКон) <> НачалоДня(КонецМесяца(ДатаКон)) Тогда
        Дней2 = День(ДатаКон);
    Иначе
        Дней2 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли;     

    Лет = Лет2 - Лет1;
    Месяцев = Месяцев2 - Месяцев1;
    Дней = Дней2 - Дней1;
	
    Возврат Цел(Лет*12 + Месяцев + Дней/30);
	
КонецФункции

Функция МассивВТаблицуЗначений(ИсходныйМассив, Знач ИмяКолонки="") Экспорт
	
	Если ПустаяСтрока(ИмяКолонки) Тогда
		ИмяКолонки = "Колонка1";
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(ИмяКолонки, " ", "_");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить(ИмяКолонки);
	
	Если ЗначениеЗаполнено(ИсходныйМассив) Тогда
		Для Сч = 1 По ИсходныйМассив.Количество() Цикл
			Результат.Добавить();
		КонецЦикла;
		Результат.ЗагрузитьКолонку(ИсходныйМассив, ИмяКолонки);
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции // МассивВТаблицуЗначений()

Функция ПолучитьПодписантаПоПраву(ДокументОбъект, Организация) Экспорт 
	
	ОтветственныйСотрудник = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
	
	ТипДокумента 		   = ТипЗнч(ДокументОбъект);
	Запрос 				   = Новый Запрос; 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Наименование", Строка(ТипДокумента));
	Запрос.Текст 		   = "ВЫБРАТЬ ПЕРВЫЕ 1
							|	ЖБИ_ПраваНастройки.Значение КАК Значение
							|ИЗ
							|	РегистрСведений.ЖБИ_ПраваНастройки КАК ЖБИ_ПраваНастройки
							|ГДЕ
							|	ВЫРАЗИТЬ(ЖБИ_ПраваНастройки.Объект КАК Справочник.Организации) = &Организация 
							|	И ЖБИ_ПраваНастройки.ПравоНастройка.СлужебныйКод = 100 
							|	И ЖБИ_ПраваНастройки.ПравоНастройка.Наименование = &Наименование";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ОтветственныйСотрудник = РезультатЗапроса.Значение;	
	КонецЕсли;
	
	Возврат ОтветственныйСотрудник; 
	
КонецФункции

Функция ПолучитьСтавкуНДСНаСервере(Номенклатура) Экспорт
	СтавкаНДС	= Номенклатура.СтавкаНДС;
	УчетНДСУП.СкорректироватьСтавкуНДС(СтавкаНДС, ТекущаяДатаСеанса());
	Возврат СтавкаНДС;
КонецФункции

Функция ПодписьПользователяФорматированныйДокумент() Экспорт
	
	ФорматированныйДокумент 		= Новый ФорматированныйДокумент;
	ТекущийПользователь 			= Пользователи.ТекущийПользователь();
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.Текст					= "ВЫБРАТЬ ПЕРВЫЕ 1
				            		  |	Пользователи.Ссылка КАК Ссылка,
				            		  |	Пользователи.ЖБИ_ЭлектроннаяПодписьПользователя КАК ЖБИ_ЭлектроннаяПодписьПользователя
				            		  |ИЗ
				            		  |	Справочник.Пользователи КАК Пользователи
									  |ГДЕ
									  |	Пользователи.Ссылка = &Пользователь	
									  |	И НЕ Пользователи.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ФорматированныйДокумент = РезультатЗапроса.ЖБИ_ЭлектроннаяПодписьПользователя.ТекстHTML.Получить();	
	КонецЕсли;
	
	Возврат ФорматированныйДокумент;
	
КонецФункции

Функция ЗаполнитьТекстПоУмолчанию() Экспорт
	
	СтруктураТема 	= Новый Структура("Тема,Текст","","");
	Запрос 			= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ЖБИ_ШаблонПочтовыхСообщений.Наименование КАК Тема,
	               |	ЖБИ_ШаблонПочтовыхСообщений.ШаблонСообщения КАК Текст
	               |ИЗ
	               |	Справочник.ЖБИ_ШаблонПочтовыхСообщений КАК ЖБИ_ШаблонПочтовыхСообщений
				   |ГДЕ
				   |	НЕ ЖБИ_ШаблонПочтовыхСообщений.ПометкаУдаления
				   |	И ЖБИ_ШаблонПочтовыхСообщений.ПоУмолчанию";	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		СтруктураТема.Тема = РезультатЗапроса.Тема;
		СтруктураТема.Текст = РезультатЗапроса.Текст;
	КонецЕсли;
	
	Возврат СтруктураТема;
	
КонецФункции

Функция ЗаполнитьВесТовара(Поставщик,НоменклатураПоставщика) Экспорт 
	
	Вес 	= 0;
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураПоставщика",НоменклатураПоставщика);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	ЖБИ_НоменклатураПоставщиков.НоменклатураПоставщика КАК НоменклатураПоставщика,
					|	ЖБИ_НоменклатураПоставщиков.Вес КАК Вес 
					|ИЗ
					|	РегистрСведений.ЖБИ_НоменклатураПоставщиков КАК ЖБИ_НоменклатураПоставщиков
					|ГДЕ
					|	ЖБИ_НоменклатураПоставщиков.Партнер = &Поставщик
					|	И ЖБИ_НоменклатураПоставщиков.НоменклатураПоставщика = &НоменклатураПоставщика";						
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Вес = РезультатЗапроса.Вес;
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

Функция УникальноеИмяФайла(ИмяФайла) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

Функция ПечатьСерверный(ИмяФормыПечати, ДокументСсылка, ДопПараметры = Неопределено) Экспорт
	
	МассивПечатныхФорм = Новый Массив;
	
	КоллекцияПечатныхФорм 	= Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");	
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	НоваяСтр 				= КоллекцияПечатныхФорм.Добавить();
	НоваяСтр.ИмяВРЕГ		= ВРЕГ(ИмяФормыПечати);
	НоваяСтр.ИмяМакета      = ИмяФормыПечати;
	
	ИмяДокумента 			= ДокументСсылка.Метаданные().Имя;
	ПараметрыПечати 		= Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	Если ДопПараметры <> Неопределено Тогда
		Если ДопПараметры.Свойство("ОтображатьФаксимиле") Тогда 
			ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
		КонецЕсли;
	КонецЕсли;
	МассивОбъектов			= Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	Если СтрНайти(ИмяФормыПечати,"ЖБИ")>0 Тогда
		Документы[ИмяДокумента].ЖБИ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, Новый СписокЗначений, Новый Структура, МассивПечатныхФорм);
	Иначе
		Документы[ИмяДокумента].Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, Новый СписокЗначений, Новый Структура);
	КонецЕсли;
	
	Возврат МассивПечатныхФорм;
	
КонецФункции
